The output for `main_ip` shouldn't ever be an empty string, I don't think.  When I run through the steps you describe, I don't see the same behavior.  All that I changed from your config replacing the `snapshot_id` with an `os_id`.

Here's the ouput from the apply:
```terraform
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # vultr_instance.Bob1[0] will be created
  + resource "vultr_instance" "Bob1" {
      + allowed_bandwidth   = (known after apply)
      + app_id              = (known after apply)
      + backups             = "disabled"
      + date_created        = (known after apply)
      + ddos_protection     = false
      + default_password    = (sensitive value)
      + disk                = (known after apply)
      + features            = (known after apply)
      + firewall_group_id   = (known after apply)
      + gateway_v4          = (known after apply)
      + hostname            = (known after apply)
      + id                  = (known after apply)
      + image_id            = (known after apply)
      + internal_ip         = (known after apply)
      + kvm                 = (known after apply)
      + label               = (known after apply)
      + main_ip             = (known after apply)
      + netmask_v4          = (known after apply)
      + os                  = (known after apply)
      + os_id               = 1946
      + plan                = "vc2-1c-1gb"
      + power_status        = (known after apply)
      + private_network_ids = (known after apply)
      + ram                 = (known after apply)
      + region              = "ewr"
      + reserved_ip_id      = (known after apply)
      + script_id           = (known after apply)
      + server_status       = (known after apply)
      + snapshot_id         = (known after apply)
      + status              = (known after apply)
      + tags                = [
          + "",
        ]
      + user_data           = (known after apply)
      + v6_main_ip          = (known after apply)
      + v6_network          = (known after apply)
      + v6_network_size     = (known after apply)
      + vcpu_count          = (known after apply)
      + vpc_ids             = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + Bob1_ipaddr = [
      + (known after apply),
    ]

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

vultr_instance.Bob1[0]: Creating...
vultr_instance.Bob1[0]: Still creating... [10s elapsed]
vultr_instance.Bob1[0]: Still creating... [20s elapsed]
vultr_instance.Bob1[0]: Still creating... [30s elapsed]
vultr_instance.Bob1[0]: Still creating... [40s elapsed]
vultr_instance.Bob1[0]: Still creating... [50s elapsed]
vultr_instance.Bob1[0]: Still creating... [1m0s elapsed]
vultr_instance.Bob1[0]: Creation complete after 1m4s [id=c9210966-d3d0-4f8c-a182-4cbd686e41e4]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

Outputs:

Bob1_ipaddr = [
  "64.176.199.130",
]
````
Output from running `terraform plan` which will destroy the just created instance since no count was provided:
```terraform
vultr_instance.Bob1[0]: Refreshing state... [id=c9210966-d3d0-4f8c-a182-4cbd686e41e4]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  - destroy

Terraform will perform the following actions:

  # vultr_instance.Bob1[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "vultr_instance" "Bob1" {
      - allowed_bandwidth   = 1 -> null
      - app_id              = 0 -> null
      - backups             = "disabled" -> null
      - date_created        = "2023-07-05T16:52:09+00:00" -> null
      - ddos_protection     = false -> null
      - default_password    = (sensitive value) -> null
      - disk                = 25 -> null
      - features            = [] -> null
      - gateway_v4          = "64.176.198.1" -> null
      - hostname            = "vultr.guest" -> null
      - id                  = "c9210966-d3d0-4f8c-a182-4cbd686e41e4" -> null
      - kvm                 = "https://my.vultr.com/subs/vps/novnc/api.php?data=djJ8OThHLVBZUVBNNGk5X1ZZYmcydkloUTZJOENfR0JUZGZ88Ycj3gQ4a2jltRX8_VTCCMD49NdYQcLMNlLfyL4o53iJJ-biesbSdPXEiB-pfrdPSH5ooxcR_rxGhpf50qK20XrC3t4wF5jtNcYW1EOcrIdHPFyugVSO-hu3Pa02H6pHTtyyv9yVMv8DGmJoCE7wOomurGt2bCAFhfhW8B5LYjW0daQuqs6wdVcKSzaXymk" -> null
      - main_ip             = "64.176.199.130" -> null
      - netmask_v4          = "255.255.254.0" -> null
      - os                  = "Ubuntu 22.10 x64" -> null
      - os_id               = 1946 -> null
      - plan                = "vc2-1c-1gb" -> null
      - power_status        = "running" -> null
      - private_network_ids = [] -> null
      - ram                 = 1024 -> null
      - region              = "ewr" -> null
      - server_status       = "installingbooting" -> null
      - status              = "active" -> null
      - tags                = [] -> null
      - v6_network_size     = 0 -> null
      - vcpu_count          = 1 -> null
      - vpc_ids             = [] -> null
    }

Plan: 0 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ Bob1_ipaddr = [
      - "64.176.199.130",
    ]

───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't guarantee to take exactly these actions if you run "terraform apply"
now.
```
Output from an apply to modify the tags of the single instance:
```terraform
vultr_instance.Bob1[0]: Refreshing state... [id=c9210966-d3d0-4f8c-a182-4cbd686e41e4]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # vultr_instance.Bob1[0] will be updated in-place
  ~ resource "vultr_instance" "Bob1" {
        id                  = "c9210966-d3d0-4f8c-a182-4cbd686e41e4"
      ~ tags                = [
          + "test",
        ]
        # (25 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

vultr_instance.Bob1[0]: Modifying... [id=c9210966-d3d0-4f8c-a182-4cbd686e41e4]
vultr_instance.Bob1[0]: Modifications complete after 0s [id=c9210966-d3d0-4f8c-a182-4cbd686e41e4]

Apply complete! Resources: 0 added, 1 changed, 0 destroyed.

Outputs:

Bob1_ipaddr = [
  "64.176.199.130",
]
```
Can you elaborate on why you want the output to be replaced with a blank string?  As far as I'm aware with [output variables in TCL](https://developer.hashicorp.com/terraform/tutorials/configuration-language/outputs), there are no default values.  It's either set or it's null.